---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPFamilyConnectorInfo Properties
MEPFamilyConnectorInfo Class See Also Send Feedback
---

The MEPFamilyConnectorInfo type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsPrimary | True if this is the primary connector.  (Inherited from MEPConnectorInfo.) |
|  | IsSecondary | True if this is the secondary connector.  (Inherited from MEPConnectorInfo.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from MEPConnectorInfo.) |
|  | LinkedConnector | The linked connector or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no linked connector  (Inherited from MEPConnectorInfo.) |

# See Also

MEPFamilyConnectorInfo Class

Autodesk.Revit.DB Namespace